; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v4 - type_2 ?v1 - type_3)
 	      (pred_3 ?v2 - object ?v1 - type_3)
	      (pred_4 ?v4 - type_2 ?v8 - type_1)
	      (pred_2 ?v4 - type_2 ?v2 - object ?v8 - type_1))

   (:action op_1
       :parameters  (?v4 - type_2 ?v5 ?v3 - type_3)
       :precondition (and  (pred_1 ?v4 ?v5))
       :effect (and  (pred_1 ?v4 ?v3)
		     (not (pred_1 ?v4 ?v5))))

   (:action op_3
       :parameters (?v4 - type_2 ?v7 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v7 ?v6) (pred_1 ?v4 ?v6) (pred_4 ?v4 ?v8))
       :effect (and (pred_2 ?v4 ?v7 ?v8)
		    (not (pred_3 ?v7 ?v6)) 
		    (not (pred_4 ?v4 ?v8))))

   (:action op_2
       :parameters (?v4 - type_2 ?v7 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v4 ?v7 ?v8) (pred_1 ?v4 ?v6))
       :effect (and (pred_3 ?v7 ?v6)
		    (pred_4 ?v4 ?v8)
		    (not (pred_2 ?v4 ?v7 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_01 - type_2
obj_07 obj_14 obj_11 obj_06 - type_1
obj_05 obj_12 obj_02 obj_09 - type_3
obj_13 obj_04 obj_10 obj_03 - object)
(:init
(pred_1 obj_08 obj_12)
(pred_4 obj_08 obj_07)
(pred_4 obj_08 obj_14)
(pred_1 obj_01 obj_09)
(pred_4 obj_01 obj_11)
(pred_4 obj_01 obj_06)
(pred_3 obj_13 obj_09)
(pred_3 obj_04 obj_02)
(pred_3 obj_10 obj_02)
(pred_3 obj_03 obj_05)
)
(:goal
(and
(pred_3 obj_13 obj_05)
(pred_3 obj_04 obj_09)
(pred_3 obj_10 obj_12)
(pred_3 obj_03 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_08 obj_12) (pred_1 obj_01 obj_12))))
    (always (not (and (pred_1 obj_08 obj_09) (pred_1 obj_01 obj_09))))
  )
)
)

; plan
1. (op_3 obj_01 obj_13 obj_09 obj_06)
   deleted: (pred_3 obj_13 obj_09) (pred_4 obj_01 obj_06)
   added: (pred_2 obj_01 obj_13 obj_06)
   goals met: 0 of 4
2. (op_1 obj_08 obj_12 obj_02)
   deleted: (pred_1 obj_08 obj_12)
   added: (pred_1 obj_08 obj_02)
   goals met: 0 of 4
3. (op_1 obj_01 obj_09 obj_05)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_05)
   goals met: 0 of 4
4. (op_3 obj_08 obj_10 obj_02 obj_14)
   deleted: (pred_3 obj_10 obj_02) (pred_4 obj_08 obj_14)
   added: (pred_2 obj_08 obj_10 obj_14)
   goals met: 0 of 4
5. (op_2 obj_01 obj_13 obj_05 obj_06)
   deleted: (pred_2 obj_01 obj_13 obj_06)
   added: (pred_3 obj_13 obj_05) (pred_4 obj_01 obj_06)
   goals met: 1 of 4
6. (op_1 obj_08 obj_02 obj_12)
   deleted: (pred_1 obj_08 obj_02)
   added: (pred_1 obj_08 obj_12)
   goals met: 1 of 4
7. (op_3 obj_01 obj_03 obj_05 obj_06)
   deleted: (pred_3 obj_03 obj_05) (pred_4 obj_01 obj_06)
   added: (pred_2 obj_01 obj_03 obj_06)
   goals met: 1 of 4
8. (op_2 obj_08 obj_10 obj_12 obj_14)
   deleted: (pred_2 obj_08 obj_10 obj_14)
   added: (pred_3 obj_10 obj_12) (pred_4 obj_08 obj_14)
   goals met: 2 of 4
9. (op_1 obj_01 obj_05 obj_02)
   deleted: (pred_1 obj_01 obj_05)
   added: (pred_1 obj_01 obj_02)
   goals met: 2 of 4
10. (op_1 obj_08 obj_12 obj_05)
   deleted: (pred_1 obj_08 obj_12)
   added: (pred_1 obj_08 obj_05)
   goals met: 2 of 4
11. (op_3 obj_01 obj_04 obj_02 obj_11)
   deleted: (pred_3 obj_04 obj_02) (pred_4 obj_01 obj_11)
   added: (pred_2 obj_01 obj_04 obj_11)
   goals met: 2 of 4
12. (op_1 obj_01 obj_02 obj_09)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_09)
   goals met: 2 of 4
13. (op_2 obj_01 obj_04 obj_09 obj_11)
   deleted: (pred_2 obj_01 obj_04 obj_11)
   added: (pred_3 obj_04 obj_09) (pred_4 obj_01 obj_11)
   goals met: 3 of 4
14. (op_1 obj_01 obj_09 obj_12)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_12)
   goals met: 3 of 4
15. (op_2 obj_01 obj_03 obj_12 obj_06)
   deleted: (pred_2 obj_01 obj_03 obj_06)
   added: (pred_3 obj_03 obj_12) (pred_4 obj_01 obj_06)
   goals met: 4 of 4
